In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'] )

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [15]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [7]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [13]:
df.drop('new',1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.shape #É uma TUPLA, por isso inplace tem que ser 1 para dropar colunas

(5, 5)

In [31]:
df.loc['A'] #Pegar linhas pelo nome

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
new    1.996388
Name: A, dtype: float64

In [35]:
df.iloc[1] ##Pegar linhas pelo index

W     -0.134841
X      0.390528
Y      0.166905
Z      0.184502
new    0.255687
Name: B, dtype: float64

In [40]:
df.loc['B','Y'] #pegar elementos

0.16690463609281317

In [43]:
df.loc[['A','B'],['X','Y']] #Pegar linha e colunas especificas

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905

In [45]:
#############################PARTE 2 DATAFRAMES#########################

In [52]:
booldf = df > 0

In [53]:
booldf

       W      X      Y      Z    new
A   True   True  False  False   True
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [55]:
df[booldf]

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN  1.996388
B       NaN  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  1.784981

In [57]:
df[df>0]

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN  1.996388
B       NaN  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  1.784981

In [69]:
df[df['W'] > 0]

A    1.693723
C    0.072960
Name: X, dtype: float64

In [62]:
resultDf = df[df['Z'] < 0]

In [64]:
resultDf

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388

In [67]:
resultDf['X']

A    1.693723
Name: X, dtype: float64

In [71]:
df[df['W'] > 0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [73]:
df[df['W'] > 0 & (df['Y'] > 1)]

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
C  0.807706  0.072960  0.638787  0.329646  0.880666

In [75]:
df[df['W'] > 0 | (df['Y'] > 1)]

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
C  0.807706  0.072960  0.638787  0.329646  0.880666

In [78]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.302665  1.693723 -1.706086 -1.159119  1.996388
1     B -0.134841  0.390528  0.166905  0.184502  0.255687
2     C  0.807706  0.072960  0.638787  0.329646  0.880666
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
4     E -0.116773  1.901755  0.238127  1.996652  1.784981

In [80]:
newind = 'CA NY WY OR CO'.split() ##Cria a lista mais facil

In [82]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [84]:
df['States'] = newind

In [86]:
df

          W         X         Y         Z       new States
A  0.302665  1.693723 -1.706086 -1.159119  1.996388     CA
B -0.134841  0.390528  0.166905  0.184502  0.255687     NY
C  0.807706  0.072960  0.638787  0.329646  0.880666     WY
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174     OR
E -0.116773  1.901755  0.238127  1.996652  1.784981     CO

In [89]:
df

          W         X         Y         Z       new States
A  0.302665  1.693723 -1.706086 -1.159119  1.996388     CA
B -0.134841  0.390528  0.166905  0.184502  0.255687     NY
C  0.807706  0.072960  0.638787  0.329646  0.880666     WY
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174     OR
E -0.116773  1.901755  0.238127  1.996652  1.784981     CO

In [91]:
##########################PARTE 3 #######################################

In [94]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [110]:
dfm = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [111]:
dfm

             A         B
G1 1  0.992573  1.192241
   2 -1.046780  1.292765
   3 -1.467514 -0.494095
G2 1 -0.162535  0.485809
   2  0.392489  0.221491
   3 -0.855196  1.541990

In [115]:
dfm.index.names = ['Groups', 'Numbers']
dfm

                       A         B
Groups Numbers
G1     1        0.992573  1.192241
       2       -1.046780  1.292765
       3       -1.467514 -0.494095
G2     1       -0.162535  0.485809
       2        0.392489  0.221491
       3       -0.855196  1.541990

In [120]:
dfm.loc['G2'].loc[2]['B'] #Pegar valores especificos

0.22149068500354543

In [122]:
dfm.loc['G1'].loc[1]['A']

0.99257345305269484

In [130]:
dfm.xs(1,level = 'Numbers')

               A         B
Groups
G1      0.992573  1.192241
G2     -0.162535  0.485809